_site/essays/cosmetics/composition/index.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8" />
    <link rel="icon" href="/favicon.ico" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <meta name="description" content="Youssef Sahli" />
    <link rel="stylesheet" type="text/css" href="/static/css/pico.orange.css" />
    <link rel="stylesheet" type="text/css" href="/static/css/within.min.css" />
    <link
      rel="stylesheet"
      type="text/css"
      href="/static/fonts/typography-setup.css"
    />
    <link rel="stylesheet" type="text/css" href="/static/css/charts.min.css" />
  </head>
  <body>
    <header class="container">
      <nav>
        <ul>
          <li><a href="/">y. sahli</a></li>
        </ul>
        <ul>
          <li>
            <form role="search" action="/search/">
              <input name="search" type="search" placeholder="Search" />
              <input type="submit" value="Search" />
            </form>
            <script></script>
          </li>
        </ul>
      </nav>
      
        <div style="text-align:center">
          <hgroup><span class="title">Composition</span></hgroup>
        </div>
      
      <hr />
    </header>
    <main class="container-fluid" data-pagefind-body>
      <div>

<h1>Formulation</h1>
<h2>Ordering</h2>
<p>Each ingredient in a <a class="org-gls" href="#gls.1" id="glsr.1.1">CP</a> is listed in a descending order of concentration.
The exact concentration is not always written, as to hide the exact recipe.</p>
<blockquote>
<p>Cosmetics marketed on a retail basis to consumers must have an ingredient list. But under the law, this list cannot be used to make a company disclose “trade secrets.”</p>
</blockquote>
<h2>Nomenclature</h2>
<p>Each ingredient have an unique ID on the International Nomenclature of Cosmetic Ingredients
(<a class="org-gls" href="#gls.2" id="glsr.2.1">INCI</a>) database. However, some products can have multiple names.</p>
<h2>Control</h2>
<p>Each commercialized <a class="org-gls" href="#gls.1" id="glsr.1.2">CP</a> has an authorization to be in the market,  supervised by each country’s  regulation entity. Each country or groups of countries (EU) define what ingredient can be used or not.</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col  class="org-left" />
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Organization</th>
<th scope="col" class="org-left">Country</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"> (<a class="org-gls" href="#gls.3" id="glsr.3.1">NICNAS</a>)</td>
<td class="org-left">Australia</td>
</tr>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<h1>Glossary</h1>
<p><strong><span class="org-glsdef" id="gls.3">CP</span></strong> Cosmetic product <a class="org-glsdef" href="#glsr.1.1">1</a>, <a class="org-glsdef" href="#glsr.1.2">2</a></p>
<h1>Acronyms</h1>
<p><strong><span class="org-glsdef" id="gls.2">INCI</span></strong> International Nomenclature of Cosmetic Ingredients <a class="org-glsdef" href="#glsr.2.1">1</a></p>
<p><strong><span class="org-glsdef" id="gls.1">NICNAS</span></strong> Australian Government’s National Industrial Chemicals Notification and Assessment Scheme <a class="org-glsdef" href="#glsr.3.1">1</a></p>

</div>
    </main>

    <footer class="container">
      <div class="container">
        <hr />
        <div class="container" role="group">
          <div class="container">
            <nav
              aria-label="breadcrumb"
              style="--pico-nav-breadcrumb-divider:'·';font-family:Neon"
            >
              <ul class='breadcrumbs'> <li><a href="/"> @ </a></li><li><a href="/essays">essays</a></li><li><a href="/essays/cosmetics">cosmetics</a></li><li>composition</li></ul>
            </nav>
          </div>
          <!-- Theme toggle copy-pasted BS -->
          <div
            class="theme-toggle"
            title="Dark mode"
            style="align-content:center"
            onclick="theme_toggle(this)"
          >
            <span class="theme-toggle-sr">Toggle theme</span>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              aria-hidden="true"
              class="theme-toggle__within"
              height="1em"
              width="1em"
              viewBox="0 0 32 32"
              fill="currentColor"
            >
              <clipPath id="theme-toggle__within__clip">
                <path d="M0 0h32v32h-32ZM6 16A1 1 0 0026 16 1 1 0 006 16" />
              </clipPath>
              <g clip-path="url(#theme-toggle__within__clip)">
                <path
                  d="M30.7 21.3 27.1 16l3.7-5.3c.4-.5.1-1.3-.6-1.4l-6.3-1.1-1.1-6.3c-.1-.6-.8-.9-1.4-.6L16 5l-5.4-3.7c-.5-.4-1.3-.1-1.4.6l-1 6.3-6.4 1.1c-.6.1-.9.9-.6 1.3L4.9 16l-3.7 5.3c-.4.5-.1 1.3.6 1.4l6.3 1.1 1.1 6.3c.1.6.8.9 1.4.6l5.3-3.7 5.3 3.7c.5.4 1.3.1 1.4-.6l1.1-6.3 6.3-1.1c.8-.1 1.1-.8.7-1.4zM16 25.1c-5.1 0-9.1-4.1-9.1-9.1 0-5.1 4.1-9.1 9.1-9.1s9.1 4.1 9.1 9.1c0 5.1-4 9.1-9.1 9.1z"
                />
              </g>
              <path
                class="theme-toggle__within__circle"
                d="M16 7.7c-4.6 0-8.2 3.7-8.2 8.2s3.6 8.4 8.2 8.4 8.2-3.7 8.2-8.2-3.6-8.4-8.2-8.4zm0 14.4c-3.4 0-6.1-2.9-6.1-6.2s2.7-6.1 6.1-6.1c3.4 0 6.1 2.9 6.1 6.2s-2.7 6.1-6.1 6.1z"
              />
              <path
                class="theme-toggle__within__inner"
                d="M16 9.5c-3.6 0-6.4 2.9-6.4 6.4s2.8 6.5 6.4 6.5 6.4-2.9 6.4-6.4-2.8-6.5-6.4-6.5z"
              />
            </svg>
          </div>
          <!-- kkk -->
        </div>
      </div>
    </footer>
    <script js>
      document.addEventListener("DOMContentLoaded", () => {
        let html = document.documentElement;
        const savedTheme = localStorage.getItem("theme") || "light";
        html.setAttribute("data-theme", savedTheme);
      });
      function theme_toggle(button) {
        button.classList.toggle("theme-toggle--toggled");
        let html = document.documentElement;
        let theme = html.getAttribute("data-theme");
        let newTheme = theme === "dark" ? "light" : "dark";
        html.setAttribute("data-theme", newTheme);
        localStorage.setItem("theme", newTheme);
      }
    </script>
  </body>
</html>
