essays/cosmetics/composition.md
---
title: Composition
---


# Formulation


## Ordering

Each ingredient in a <a class="org-gls" href="#gls.1" id="glsr.1.1">CP</a> is listed in a descending order of concentration. The exact concentration is not always written, as to hide the exact recipe.

> Cosmetics marketed on a retail basis to consumers must have an ingredient list. But under the law, this list cannot be used to make a company disclose “trade secrets.”


## Nomenclature

Each ingredient have an unique ID on the International Nomenclature of Cosmetic Ingredients (<a class="org-gls" href="#gls.2" id="glsr.2.1">INCI</a>) database. However, some products can have multiple names.


## TODO Control

Each commercialized <a class="org-gls" href="#gls.1" id="glsr.1.2">CP</a> has an authorization to be in the market, supervised by each country’s regulation entity. Each country or groups of countries (EU) define what ingredient can be used or not.

| Organization                                                                                                                                          | Country   |
|----------------------------------------------------------------------------------------------------------------------------------------------------- |--------- |
| Australian Government’s National Industrial Chemicals Notification and Assessment Scheme
 (<a class="org-gls" href="#gls.3" id="glsr.3.1">NICNAS</a>)  | Australia |
|                                                                                                                                                       |           |


# Glossary

**<span class="org-glsdef" id="gls.3">CP</span>**&emsp;Cosmetic product&ensp;<a class="org-glsdef" href="#glsr.1.1">1</a>, <a class="org-glsdef" href="#glsr.1.2">2</a>


# Acronyms

**<span class="org-glsdef" id="gls.2">INCI</span>**&emsp;International Nomenclature of Cosmetic Ingredients&ensp;<a class="org-glsdef" href="#glsr.2.1">1</a>

**<span class="org-glsdef" id="gls.1">NICNAS</span>**&emsp;Australian Government’s National Industrial Chemicals Notification and Assessment Scheme&ensp;<a class="org-glsdef" href="#glsr.3.1">1</a>
